Tekla Open API Reference for Tekla Structures 2025
Cloud.Attributes Property
 The attributes for the cloud.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Cloud.CloudAttributes Attributes { get; set; }
Public Property Attributes As Cloud.CloudAttributes
	Get
	Set
Property Value
Type: Cloud.CloudAttributes
See Also
Reference
Cloud Class
Tekla.Structures.Drawing Namespace